#include<stdio.h>
#include<assert.h>
#include<string.h>
#include<stdlib.h>
#include<stdbool.h>
#include<errno.h>
#include<ctype.h>
#include<stddef.h>

//操作符
//算术操作符 + - * % /
//int main()
//{
//	int a = 7 / 2; //整型除法
//	int b = 7 % 2;// %取模，即取两端相除后的余数，其两端的数必须是整型
//	float c = 7 / 2.0;//  /要有小数点运算，需其两端有浮点数
//	printf("%d\n", a);
//	printf("%d\n", b);
//	printf("%.1f\n", c);// %.xf 中.x要求保留x未小数
//}

//移位操作符 <<  >>
//两端的数需要都是整型，移位数不能为负数
//移动二进制位，在补码上移动
// << 左移位操作符 在左边丢弃，右边加上并补0
// >> 右移位操作符
//算数移位：右边丢弃，左补原符号（确定正负）
//逻辑移位：右边丢弃，左补0
//二进制 0 - 1
//八进制 0 - 7
//十进制 0 - 9
//十六进制 0 - 9  a - f
//整数的二进制表示有三种：
//源码
//反码
//补码
//正整数 三者相同	负整数 反码(源码的符号位不变，其他位取反1->0 0->1) 补码(反码+1)
//符号位为0，该整数为正，为1则为负
// 
//int main()
//{
//	int a = 3; //初始化
//	int b = a << 1;//左移操作符移动的是二进制位 此处在补码码上左边丢弃一位，右边加上并补0
//	//同时每个数 a<<1 发挥了 a *= 2的作用
//
//	printf("a = %d ", a);
//	printf("b = %d\n", b);//%d只按源码打印
//
//	return 0;
//}

//位操作符 ^ & |
// & 按（二进制）位与	 补码中对应的二进制位有0则0，同时为1则1	 (按位与假则假)
// | 按（二进制）位或	 补码中对应的二进制位有1则1，同时为0则0	 (按位或真则真)
// ^ 按（二进制）位异或  补码中对应二进制为相同为0，相异为1	 (同则0，异则1)
// 0 ^ a = a	a ^ a = 0	^ 的运算可适用交换律
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	int d = a | b;
//	int e = a ^ b;
//	printf("c = %d\n", c);
//	printf("d = %d\n", d); 
//	printf("e = %d\n", e);
//	//整数在内存中存的是其补码
//	return 0;
//}

//赋值操作符 = -= += <= >= &= ^= |= <<= >>=

//单目操作符：只有一个操作数的操作符
//C语言中用0表示逻辑上的假，非0的数表示逻辑上的真
// !表示逻辑反操作  &取址 sizeof()  +-正负号  后置++先使用后加  前置++先加后使用 前、后置的--同理  (类型)强制类型转化
// ~ 对一个数的二进制按位取反
// * 间接访问操作符(解引用操作符)  常与 & 一起用
// sizeof是用来计算（类型）/变量所占内存空间大小的操作符，单位是比特,不关注其中存放的具体内容
// strlen是专门计算字符串长度的库函数，从参数给定的地址向后到\0,统计\0前字符的个数
// 
//int main()
//{
//	//int arr[10] = { 0 };
//	//printf("%d\n", sizeof( arr));//一个整型4个字符，此处arr中有十个元素，故40个字节
//	// 
//	//int a = 10;
//	//int b = a++;
//	//int b=a;
//	//a =a+1;
//	//printf("%d\n", a);//11
//	//printf("%d\n", b);//10
//	//int c = ++a;
//	//a=a+1, int c=a
//	//printf("%d\n", c);//12
//	//int e = (int)3.14;//字面小数vs编译器默认是double类型，而用(int)3.14能将3.14强制转化为整型3
//	//printf("%d\n", e);
//	// 
//	// int f =0;
//	//printf("%d\n", ~f);
//	// 
//	//int flag = 6;
//	//if (flag)
//	//{
//	//	printf("%d\n", flag);
//	//}
//	//else if (!flag)
//	//{
//	//	printf("%d\n", flag - 3);
//	//}
//	//printf("%p\n", &flag);//& 取的是变量在内存中的起始地址
//
//	int i = 13;
//	//00000000000000000000000000011101
//	//00000000000000000000000000010000
//	//11111111111111111111111111101111	~
//	//00000000000000000000000000010000 
//	//想改变一个数的具体某个二进制位，可用(1 << x)这样的类似方法
//	//i |= (1 << 4);//29
//	//printf("%d\n", i);
//	//i &= (~(1 << 4));
//	//printf("%d\n", i);//13
//	int* p = &i;//用p存储i的地址
//	*p = 20;//*对p解引用操作，从而找到p所存地址里的量
//	printf("%d\n", i);
//
//	return 0;
//}
////
//int i;//此处的i为全局变量
//int main()
//{
//	i--;//-1
//	//sizeof(i)返回的是int i空间大小(4)，是一个无符号整型(unsiged int)
//	if (i > sizeof(i))//-1 4	类型大小超过int时会进行算术转换，int i 会转化为unsigned int i并视为一个很大的数，所以执行if而不else
//	{
//		printf("<\n");
//	}
//	else
//	{
//		printf(">\n");
//	}
//	return 0;
//}

//关系操作符
// ==  < > <= >=  !=（不等于）
//int main()
//{
//	int a = 10;
//	if (a == 3) //a=3是赋值的过程，赋值后条件a=3为真，如果a==3及判断a的值是否为3故条件为假执行else
//	{
//		printf("hello\n");
//	}
//	else
//	{
//		printf("hi\n");
//	}
// 
// if ('abc' == 'abcd')// == 用于比较字符串，只是比较其首元素的地址，而不比较其内容，而比较字符串要用strcmp
//	{
//		printf("err\n");
//	}
// 
//	return 0;
//}

//逻辑操作符
// && 逻辑与   || 逻辑或
// &&左边为假，右边不计算   ||左边为真，右边不计算
//int main()
//{
//	//int a = 10;
//	//int b = 16;
//	//int c = a && b;//两边都为真时，默认返回1，两边若存在假则返回0
//	//int d = a && 0;
//	//b = 0;
//	//c = a || b;
//	//a = 0;//两边至少为一真时则返回1，两边都为假则返回0
//	//d = a || b;
//	//printf("%d\n", c);
//	//printf("%d\n", d);
//	//if (a && b)//  &&要求两边同时为真  ||要求两边至少一真
//	//{
//	//	printf("hello\n");
//	//}
//
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;// &&前的a在使用时为0为假，所以&&后面部分没有计算
//	printf("a = %d,b = %d,c = %d,d = %d\n", a, b, c, d);
//	a = 1;
//	i = a++ && ++b && d++;
//	printf("a = %d,b = %d,c = %d,d = %d\n", a, b, c, d);
//	a = 0;
//	i = a++ || ++b || d++;
//	printf("a = %d,b = %d,c = %d,d = %d\n", a, b, c, d);
//	a = 1;
//	i = a++ || ++b || d++;// ||前的a为1时为真，根据 || 要至少一真，则已符合条件，||后面部分不计算
//	printf("a = %d,b = %d,c = %d,d = %d\n", a, b, c, d);
//	a = 0;
//	i = a++ || ++b || d++;//此处同理
//	printf("a = %d,b = %d,c = %d,d = %d\n", a, b, c, d);
//
//	return 0;
//}

//条件操作符
//exp1?  exp2:  exp3 三目操作符 有三个操作数
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int r = (a > b? a: b);
//	printf("%d\n", r);
// 
//	return 0;
//}
// exp1? exp2: exp3
//  真    T     F
//  假    F     T

//逗号表达式：逗号隔开的一串表达式  从左向右一次计算，结果是最后一个表达式的结果
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = 0;
//	int r = (a = b + c,b=a-10,c=b+a);
//	printf("%d\n", r);
// 
//	return 0;
//}

//下标操作引用符
//arr[X] 其中arr和X就是[]的操作数，引用arr里的元素时[X]的X可以是变量
//有两个操作数的操作符可适用于交换律
//所以引用时还可以写成X[arr]的形式 但建议不这样写，定义初始化时也不能这样写
//因arr存的是首元素的地址 arr[X] <--> *(arr+X) <--> *(X+arr) <--> 7[arr] 即是用[]跳过X个元素，指向第X+1个元素

//函数调用操作符
//函数操作符的操作数为：函数名 传给函数的参数
//其操作数至少为一个
//函数定义
//int Add(int x, int y)
//{
//	return x + y;
//}
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int c = Add(a, b);//函数后面的 () 就是函数调用操作符，此处Add a b 就是()的操作数
//	printf("%d\n", c);
//
//	return 0;
//}

//结构(体)成员访问操作符 . ->  *.
//结构体指针->结构体成员
//结构体对象.结构体成员
// ps->age 等价于 (*ps).age 
//struct stu
//{
//	char name[20];
//	int age;
//	double score;
//};
//
//void set_stu(struct stu* ps)
//{
//
//	strcpy_s(ps->name,20, "zhangsan");
//	ps->age = 18;
//	ps->score = 100.0;
//}
//
//void print_stu(struct stu ss)
//{
//	printf("%s %d %lf\n", ss.name, ss.age, ss.score);
//}
//
//int main()
//{
//	struct stu s ,*p = &s;
//	set_stu(&s);
//	print_stu(s);
//	printf("%s\n",(*p).name);
//
//	return 0;
//}