#include<stdio.h>
#include<assert.h>
#include<string.h>
#include<stdlib.h>
#include<stdbool.h>
#include<errno.h>
#include<ctype.h>
#include<stddef.h>

//数据储存
//数据结构：数据在内存中的存储结构
//数据类型：
//整型、浮点型
//自定义类型：数组、结构体 struct、枚举 enum、联合类型 union
//指针类型

//整型在内存中的存储
//数值有不同表示形式：2进制、8进制、10进制、16进制
//整数的二进制也有三种表示形式：
// 原码：直接按正负的形式写出的二进制序列
// 反码：原码符号位不变，其他位按位取反
// 补码：反码+1
//
// 对于补码转化回原码，普通人会将补码-1再按位取反得回原码，
// 但实际上计算机是将补码按位取反再+1得回原码
// 所以原码与补码计算过程相同，不需要额外硬件电路
// 
// 计算机的运算都是进行补码运算再转为原码,且 CPU 只有加法运算，通过补码的相加运算就解决减法的运算
// 
//注：正数的原码、反码、补码都相同
//	  最高位为符号位
//int main()
//{
//	//注：4个二进制位就是一个十六进制位
//	int a = 20;
//	//00000000000000000000000000010100 - 原码
//	//0x00 00 00 14						 十六进制
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//0x80 00 00 0a
//	//11111111111111111111111111110101 - 反码
//	//0xff ff ff f5
//	//11111111111111111111111111110110 - 补码
//	//0xff ff ff f6
//
//	//整数在内存中存放的是补码的二进制序列，而vs调试中显示的是十六进制，但并不意味着补码在内存中是十六进制
//	//数值在内存中存补码，有利于计算机再进行运算时将加减法统一处理(CPU只有加法器)
//	//e.g:	1-1 ——> 1+(-1)
//	// 若以原码计算
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//10000000000000000000000000000010	 //最后反而得出-2
//	// 补码计算
//	//00000000000000000000000000000001
//	//11111111111111111111111111111111
//	//100000000000000000000000000000000  //因只有32位，所以最高位被舍弃
//	//00000000000000000000000000000000	 //最后结果为0
//	return 0;
//}

//大小端
//大端【字节序】存储：把一个数的高字节序的内容放在低地址处，低字节序的内容放在高地址处
//小端【字节序】存储：把一个数的低字节序的内容放在低地址处，高字节序的内容放在高地址处
//e.g :
// 0x11223344
// 11是高字节序，44是低字节序
//而vs的内存存储是小端【字节序】存储
//如何判断内存存储方式是大端还是小端
//int main()
//{
//	int a = 1;
//	if (*(char*)&a == 1)//因&a是int* 解引用时访问四个字节，将其强制类型转化为char*后，解引用时访问的便是一个字节
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	signed char b = -1;//有符号的char范围为-128 到 127
//	unsigned char c = -1;//无符号的char的范围为0 到 128+127=255
//	//当其他整形放在char中放不下时会对其进行截断,而将数据从该内存中取出时是完整取出的
//	
//	printf("a=%d b=%d c=%d\n", a, b, c);//因%d是打印有符号整型，所以a、b、c在这进行了整型提升
//	//对于c因其是无符号整型，在整型提升时其符号位不会被认为是符号位，同时在其高位补0
//
//	return 0;
//}
 //unsigned short 0 - 65535
 //short -32768 - 32767
//
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000	源码
//	//11111111111111111111111101111111	反码
//	//11111111111111111111111110000000	补码
//	//而char a内存里只存了10000000		这个过程也发生了截断
//	//要用%u打印时进行整型提升 根据其类型（本题中为char）的高位补相应数字
//	//11111111111111111111111110000000	%u打印会将其视为一个正数进行打印
//	//用%d打印就会将按照反码按位取反再加1得到源码进行打印
//	//10000000000000000000000001111111
//	//10000000000000000000000010000000
//	printf("%u\n", a);
//	printf("%d\n", a);
//	return 0;
//}
////
//int main()
//{
// //char存储 -128 ~ 127
//	char a = 128;
//	printf("%d\n", a);
//	printf("%u\n", a);
//	return 0;
//}
////
//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//
//	unsigned int j = 10;
//	//00000000000000000000000000001010
//
//	printf("%d\n", i + j);
//	//11111111111111111111111111101100	-20补码
//	//00000000000000000000000000001010	 10补码
//	//11111111111111111111111111110110
//	//10000000000000000000000000001001
//	//10000000000000000000000000001010	-10
//
//	return 0;
//}
//
//int main()
//{
//	char a[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%zu\n", strlen(a));
//	// char
//	// -128 -> 0 -> 127 -> -128
//	//本题
//	//-1 -2 -3 …… -128 127 126 …… 0
//	return 0;
//}
//
//unsigned char i = 0;
//int main()
//{
//	//因unsigned char 为0 - 255
//	//当i == 255时，再++，i就变成了0，所以结果是死循环
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hehe\n");
//	}
//
//	return 0;
//}
//
//下面这题的知识点和结果与上一题一样
//int main()
//{
//	unsigned char i = 0;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//
//	return 0;
//}


//浮点型在内存中的存储
//int main()
//{
//	int n = 9;
//	//00000000000000000000000000001001		
//
//	float* pf = (float*)&n;
//	//0 00000000 00000000000000000001001	这里E为全0
//	//E = 1 -127 = -126
//	//M = 0.00000000000000000001001
//	//+ 0.00000000000000000001001 *2^(-126)		%f按这个来打印
//
//	printf("n = %d\n", n);//9
//	printf("*pf = %f\n", *pf);//0.000000
//	*pf = 9.0;
//	//1001.0
//	//1.001 *2^3
//	//此时 S=0  M=1.001  E=3	3+127=130
//	//0 100001010 001000000000000000000000
//	//下边的%d打印n会将此视为补码然后转换为源码进行打印
//	printf("n = %d\n", n);//1091567616
//	printf("*pf = %f\n", *pf);
//
//	return 0;
//}
//以上的例子说明整数与浮点数在内存中的存储是不一样的

//浮点数存储规则
//任何一个浮点数可表示为以下形式
// (-1)^S * M * 2^E			其中 ^ 为次方
// (-1)^S为符号位，S是个具体数值 	
// M (1<= M <2)表示有效数字
// 2^E表示指数位
//M * 2^E 是浮点数在二进制中的科学计数法
//如 5.0 -> 101.0 -> 1.01*2^2
//	 9.5 -> 1001.1
//可并不是全部的浮点数都能这样表示 如9.6f	这说明了浮点数在内存中无法精确计算的原因
//且E为无符号数
//若E在科学计数法会为负数，所以E需加一个中间值再放入内存中
//float  -> E(真实值) + 127(中间值)  -> 储存
//double -> E(真实值) + 1023(中间值) -> 储存
//如5.5 十进制
//101.1	二进制
//1.011*2^2
//S=0 M=1.011 E=2
//2+127 = 129
//01000000101100000000000000000000000000000	内存
//0100 0000 1011 0000 0000 0000 0000 0000 000000000	四个二进制位换成十六进制位
//  4	 0	  b	   0	0	 0	  0	   0
// 0x40 b0 00 00	十六进制
//S E+中间值 M去掉第一位的1
//int main()
//{
//	float a = 5.5;//在调试中查看内存
//	//printf("%d\n", a);
//	return 0;
//}
//
//E 从内存中取出分为三种情况(32位存8位 64存11位)
//E不全为1或全为0		整么放进去就整么拿出来
//E为全0		E = (1-127)或(1-1023) M不再加上第一位的1，而是还原为0.xxxx的小数	这样是为了表示正负无穷小的数
//E为全1		M全为0	这样是为了表示正负无穷大的数